ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_ssu_cpu2_cfg_regs.xml
<module id="SSU_CPU2_CFG_REGS" HW_revision="" description="SSU CPU2 CFG Registers">
	<register id="RST_VECT" width="32" page="0" offset="0x0" instances="1" instaddr="4" internal="0" description="CPU Reset Vector">
		<bitfield id="ADDR" description="Reset Vector Address" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="RST_LINK" width="32" page="0" offset="0x4" instances="1" instaddr="4" internal="0" description="CPU Reset LINK">
		<bitfield id="LINK" description="Reset LINK Value" begin="3" end="0" width="4" rwaccess="RW"/>
	</register>
	<register id="CPU_RST_CTRL" width="32" page="0" offset="0x8" instances="1" instaddr="4" internal="0" description="CPU Reset Control">
		<bitfield id="SW_SYSRSN" description="System CPU Reset" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="DEF_NMI_VECT" width="32" page="0" offset="0x10" instances="1" instaddr="4" internal="0" description="Default CPU NMI Vector">
		<bitfield id="ADDR" description="Default NMI Vector Address" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="DEF_NMI_LINK" width="32" page="0" offset="0x14" instances="1" instaddr="4" internal="0" description="Default CPU NMI LINK">
		<bitfield id="LINK" description="Default NMI LINK Value" begin="3" end="0" width="4" rwaccess="RW"/>
	</register>
	<register id="EMU_BOOTDEF_LOW" width="32" page="0" offset="0x28" instances="1" instaddr="4" internal="0" description="User Emulation Boot Definition Low Register">
		<bitfield id="BOOT_DEF0" description="Boot Definitions 0" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="BOOT_DEF1" description="Boot Definitions 1" begin="15" end="8" width="8" rwaccess="RW"/>
		<bitfield id="BOOT_DEF2" description="Boot Definitions 2" begin="23" end="16" width="8" rwaccess="RW"/>
		<bitfield id="BOOT_DEF3" description="Boot Definitions 3" begin="31" end="24" width="8" rwaccess="RW"/>
	</register>
	<register id="EMU_BOOTDEF_HIGH" width="32" page="0" offset="0x2c" instances="1" instaddr="4" internal="0" description="User Emulation Boot Definition High Register">
		<bitfield id="BOOT_DEF4" description="Boot Definitions 4" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="BOOT_DEF5" description="Boot Definitions 5" begin="15" end="8" width="8" rwaccess="RW"/>
		<bitfield id="BOOT_DEF6" description="Boot Definitions 6" begin="23" end="16" width="8" rwaccess="RW"/>
		<bitfield id="BOOT_DEF7" description="Boot Definitions 7" begin="31" end="24" width="8" rwaccess="RW"/>
	</register>
	<register id="LINK3_CFG" width="32" page="0" offset="0x3c" instances="1" instaddr="4" internal="0" description="LINK3 Configuration">
		<bitfield id="STACK" description="STACK Association" begin="2" end="0" width="3" rwaccess="RW"/>
	</register>
	<register id="LINK4_CFG" width="32" page="0" offset="0x40" instances="1" instaddr="4" internal="0" description="LINK4 Configuration">
		<bitfield id="STACK" description="STACK Association" begin="2" end="0" width="3" rwaccess="RW"/>
	</register>
	<register id="LINK5_CFG" width="32" page="0" offset="0x44" instances="1" instaddr="4" internal="0" description="LINK5 Configuration">
		<bitfield id="STACK" description="STACK Association" begin="2" end="0" width="3" rwaccess="RW"/>
	</register>
	<register id="LINK6_CFG" width="32" page="0" offset="0x48" instances="1" instaddr="4" internal="0" description="LINK6 Configuration">
		<bitfield id="STACK" description="STACK Association" begin="2" end="0" width="3" rwaccess="RW"/>
	</register>
	<register id="LINK7_CFG" width="32" page="0" offset="0x4c" instances="1" instaddr="4" internal="0" description="LINK7 Configuration">
		<bitfield id="STACK" description="STACK Association" begin="2" end="0" width="3" rwaccess="RW"/>
	</register>
	<register id="LINK8_CFG" width="32" page="0" offset="0x50" instances="1" instaddr="4" internal="0" description="LINK8 Configuration">
		<bitfield id="STACK" description="STACK Association" begin="2" end="0" width="3" rwaccess="RW"/>
	</register>
	<register id="LINK9_CFG" width="32" page="0" offset="0x54" instances="1" instaddr="4" internal="0" description="LINK9 Configuration">
		<bitfield id="STACK" description="STACK Association" begin="2" end="0" width="3" rwaccess="RW"/>
	</register>
	<register id="LINK10_CFG" width="32" page="0" offset="0x58" instances="1" instaddr="4" internal="0" description="LINK10 Configuration">
		<bitfield id="STACK" description="STACK Association" begin="2" end="0" width="3" rwaccess="RW"/>
	</register>
	<register id="LINK11_CFG" width="32" page="0" offset="0x5c" instances="1" instaddr="4" internal="0" description="LINK11 Configuration">
		<bitfield id="STACK" description="STACK Association" begin="2" end="0" width="3" rwaccess="RW"/>
	</register>
	<register id="LINK12_CFG" width="32" page="0" offset="0x60" instances="1" instaddr="4" internal="0" description="LINK12 Configuration">
		<bitfield id="STACK" description="STACK Association" begin="2" end="0" width="3" rwaccess="RW"/>
	</register>
	<register id="LINK13_CFG" width="32" page="0" offset="0x64" instances="1" instaddr="4" internal="0" description="LINK13 Configuration">
		<bitfield id="STACK" description="STACK Association" begin="2" end="0" width="3" rwaccess="RW"/>
	</register>
	<register id="LINK14_CFG" width="32" page="0" offset="0x68" instances="1" instaddr="4" internal="0" description="LINK14 Configuration">
		<bitfield id="STACK" description="STACK Association" begin="2" end="0" width="3" rwaccess="RW"/>
	</register>
	<register id="LINK15_CFG" width="32" page="0" offset="0x6c" instances="1" instaddr="4" internal="0" description="LINK15 Configuration">
		<bitfield id="STACK" description="STACK Association" begin="2" end="0" width="3" rwaccess="RW"/>
	</register>
	<register id="STACK3_CFG" width="32" page="0" offset="0x7c" instances="1" instaddr="4" internal="0" description="STACK3 Configuration">
		<bitfield id="ZONE" description="ZONE Association" begin="1" end="0" width="2" rwaccess="RW"/>
	</register>
	<register id="STACK4_CFG" width="32" page="0" offset="0x80" instances="1" instaddr="4" internal="0" description="STACK4 Configuration">
		<bitfield id="ZONE" description="ZONE Association" begin="1" end="0" width="2" rwaccess="RW"/>
	</register>
	<register id="STACK5_CFG" width="32" page="0" offset="0x84" instances="1" instaddr="4" internal="0" description="STACK5 Configuration">
		<bitfield id="ZONE" description="ZONE Association" begin="1" end="0" width="2" rwaccess="RW"/>
	</register>
	<register id="STACK6_CFG" width="32" page="0" offset="0x88" instances="1" instaddr="4" internal="0" description="STACK6 Configuration">
		<bitfield id="ZONE" description="ZONE Association" begin="1" end="0" width="2" rwaccess="RW"/>
	</register>
	<register id="STACK7_CFG" width="32" page="0" offset="0x8c" instances="1" instaddr="4" internal="0" description="STACK7 Configuration">
		<bitfield id="ZONE" description="ZONE Association" begin="1" end="0" width="2" rwaccess="RW"/>
	</register>
	<register id="RAMOPENSTAT" width="32" page="0" offset="0x90" instances="1" instaddr="4" internal="0" description="RAMOPEN Feature Status Register">
		<bitfield id="LINK1_RAMOPENS" description="LINK1 RAM Open Status Bit" begin="1" end="1" width="1" rwaccess="R"/>
	</register>
	<register id="RAMOPENFRC" width="32" page="0" offset="0x94" instances="1" instaddr="4" internal="0" description="RAMOPEN Feature Force Register">
		<bitfield id="SET_LINK1" description="Set LINK1 RAM Open Request" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="WIPE_ON_LINK1_CLR" description="Wipe LINK1 RAM on Clear Request" begin="12" end="12" width="1" rwaccess="RW"/>
	</register>
	<register id="RAMOPENCLR" width="32" page="0" offset="0x98" instances="1" instaddr="4" internal="0" description="RAMOPEN Feature Clear Register">
		<bitfield id="CLEAR_LINK1" description="Clear LINK1 RAM Open Request" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="DECODER_ADDR_IN" width="32" page="0" offset="0xa0" instances="1" instaddr="4" internal="0" description="SW ZONE Decoder Address Input">
		<bitfield id="ADDR_L" description="Address Bits 15:12" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="ADDR_H" description="Address Bits 31:16" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="DECODER_OUT" width="32" page="0" offset="0xa4" instances="1" instaddr="4" internal="0" description="SW ZONE Decoder Output">
		<bitfield id="LINK" description="Decoded LINK" begin="3" end="0" width="4" rwaccess="R"/>
		<bitfield id="STACK" description="Decoded STACK" begin="6" end="4" width="3" rwaccess="R"/>
		<bitfield id="ZONE" description="Decoded ZONE" begin="9" end="8" width="2" rwaccess="R"/>
		<bitfield id="APR" description="Access Protection Region" begin="22" end="16" width="7" rwaccess="R"/>
		<bitfield id="INVALID" description="Decoder Output Invalid" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="EMU_DECODER_ADDR_IN" width="32" page="0" offset="0xa8" instances="1" instaddr="4" internal="0" description="SW ZONE Decoder Address Input">
		<bitfield id="ADDR_L" description="Address Bits 15:12" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="ADDR_H" description="Address Bits 31:16" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="EMU_DECODER_OUT" width="32" page="0" offset="0xac" instances="1" instaddr="4" internal="0" description="SW ZONE Decoder Output">
		<bitfield id="LINK" description="Decoded LINK" begin="3" end="0" width="4" rwaccess="R"/>
		<bitfield id="STACK" description="Decoded STACK" begin="6" end="4" width="3" rwaccess="R"/>
		<bitfield id="ZONE" description="Decoded ZONE" begin="9" end="8" width="2" rwaccess="R"/>
		<bitfield id="APR" description="Access Protection Region" begin="22" end="16" width="7" rwaccess="R"/>
		<bitfield id="INVALID" description="Decoder Output Invalid" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
</module>
